chat_system_729954315_actor_description=King Mark. Your King.
chat_system_729954315_snap_0_question=^?^What brings you here, my faithful [class]? I hope you have good news for us!
chat_system_729954315_snap_0_answer_0=^?^I wanted to ask you a couple of questions, Your Majesty.
chat_system_729954315_snap_0_answer_1=^?^I do think I have something that will spark your interest. 
chat_system_729954315_snap_0_answer_2=^?^I have to go, Your Majesty.
chat_system_729954315_snap_question_question=^?^Well. I guess we can find some time for you. What's on your mind, [player]?
chat_system_729954315_snap_question_answer_0=^?^Do you know why the dwarves attacked the Creiston Mines?
chat_system_729954315_snap_question_header_0=^?^These mines have always belonged to us! Dwarves have been renting them for several centuries - and it costs them quite a bit each year...<br>Well, it always did in the past, but this year they didn't pay on the agreed date. Moreover, instead of gold, the arrogant Torn Digor sent an army to occupy the mines! <br>So it made sense to sell the mine to Baron Ahey, who has been interested in the mining rights for many years, and who himself helped to repulse the dwarven attack.
chat_system_729954315_snap_question_answer_1=^?^I would like to know more about the Necromancers Rebellion, Your Majesty!
chat_system_729954315_snap_question_answer_2=^?^I'd like to know more about the Islands of Freedom.
chat_system_729954315_snap_question_answer_3=^?^Nothing, I won't disturb you any further.
chat_system_729954315_snap_2_question=^?^That happened two hundred years ago, when Larg Leonard ruled Darion. The necromancers who had been banished from Darion by His Majesty returned, first inflicted a plague, which mowed down a half of the population. Then the Gate to the Land of Death opened, and hordes of undead creatures poured into Darion.<br>The war against the necromancers lasted for many years, and were it not for King Vilor, who had ascended the throne after King Larg died of the plague, I don't know how it could have ended...
chat_system_729954315_snap_2_answer_0=^?^So what did King Vilor do?
chat_system_729954315_snap_2_header_0=^?^First, he created the Order of the Paladins - an order of warriors, blessed by the gods to fight the undead creatures! Endowed with sacred power, the paladins successfully fought down the corpses - but the sorcerers would raise their fallen armies again and again.<br>Then King Vilor Eliar went to the pyramid known as the Temple of Discoveries, wherein the priests gave him a manuscript found by King Fandor on the Island of Titans. In that scroll was described a rite which allowed him to obtain the Titan Zerron's power. After performing the rite, King Vilor lost his eyes, but obtained in their place the gaze of Zerron. The look of his empty eye-sockets turned entire undead armies into dust, and the paladins marched forward, to destroy the Gate of Death.
chat_system_729954315_snap_1_question=^?^That is an Island State, in the northern waters, where live criminals and fortune hunters. It's a pirates' and smugglers' paradise! Only the laws of the Islands are enforced there, and they were created by and for pirates, and so in a way these truly are Islands of Freedom.<br>The governor is considered to be the ruler there. He has a treasury, an army, and he enacts the laws and sees that they are observed. The Islands of Freedom are considered to be the province of Darion, but except for the taxes paid regularly to our treasury, nothing really binds Darion with the Islands.
chat_system_729954315_snap_1_answer_0=^?^Why do you stand such lawlessness?
chat_system_729954315_snap_1_header_0=^?^Gold! The great amounts of gold that flows into Darion's treasury. Every governor realizes that the islands exist only so long as the King of Darion wishes them to exist, and so they do not begrudge us their gold.<br>In fact, nothing happens on the islands without our Majesty's knowledge. Several times there have been attempts to secede from Darion, but... pirates and robbers are not used to obedience, so they were unable to unite around a common leader, even when they faced great risk! Even in spite of their huge fleet and extensive combat experience, all this power remains useless because no one can control it. In addition, Governor Thompson had occupied his position only through my assistance, and he understands all of this very clearly.
chat_system_729954315_snap_1_answer_1=^?^Well, it looks like there's a lot of interesting things for me to find. Wouldn't you say, Your Majesty?
chat_system_729954315_snap_1_header_1=^?^Here is a real Treasure Searcher! You're absolutely right. The pirates attack ships and coastal cities, do various smuggling, and take tribute from the merchants up and down the coast. Gold flows into their hands - and every boy in his childhood surely dreamt of digging out a pirate's treasure!<br>I don't really know if it's tradition or just a question of prestige, but every self-respecting pirate will definitely hide part of his treasure hoard for a rainy day. Our former Treasure Seeker de'Virre liked to busy himself with these searches...
chat_system_729954315_snap_1_answer_2=^?^How was this state formed?
chat_system_729954315_snap_1_header_2=^?^There's a small group of islands to the north of Darion. A questionable border territory, which had always caused conflicts with elves. At one time we had occupied them, next they controlled the interests there...<br>Tensions eased when one of my ancestors leased the islands out to pirates and robbers. By the king's order, all prominent criminals were brought there. They built houses and shipyards for them, several ports and workshops. Surprisingly, but sure enough it worked! After realizing they were free, the criminals and killers had a good laugh, but soon enough came to their senses. And one pirate, Dick Raynolds and his gang, took them by the throat. He set a kind of order there, introduced laws and declared himself a governor of the Islands. Thus the ruling order was set, and has remained in place ever since...
chat_system_729954315_snap_1_answer_3=^?^I have one or two other questions, Your Majesty...
chat_system_729954315_snap_1_header_3=^?^Ask, [player]. But remember, much knowledge causes much trouble! It seems to me that one of my advisers once told me this... But then again, he was quite silly - that's why he didn't manage to stay at court for long.
chat_system_729954315_snap_1_answer_4=^?^Well then, I've learned everything I wanted, Your Majesty.
chat_system_729954315_snap_3_question=^?^And what is this?
chat_system_729954315_snap_3_answer_0=^?^This is a map of Endoria, drawn by the hand of King Fandor the Traveler!
chat_system_729954315_snap_4_question=^?^King Fandor's map?! How can you have visited so many places in Endoria?! Truly amazing!<br>And what an amazing piece! According to the legend, when a person of noble blood takes it into his hands, he becomes able to see with his own eyes all that Fandor had seen. What can I offer you for it?
chat_system_729954315_snap_4_answer_0=^?^I think that cash would be the best payment.
chat_system_729954315_snap_5_question=^?^Oh, I think that two hundred fifty thousand thousand gold coins should be quite enough.
chat_system_729954315_snap_5_answer_0=^?^Yes, of course, thank you. Now you are the sole owner of the United Map of Endoria!
chat_system_729954315_snap_5_answer_1=^?^I'm sorry, Your Majesty, I must have left the map in the pyramid. But I'll bring it next time...
